app/Http/Controllers/AparelhoEletricoController.php

select * from "aparelho_eletrico"
---
    public function index()
    {
        $aparelhos_eletricos = AparelhoEletrico::all();

insert into "aparelho_eletrico" ("marca", "codigo", "nome", "potencia", "voltagem_minima", "voltagem_maxima", "corrente_maxima_entrada", "updated_at", "created_at") values ('3', '0', 'teste', null, null, null, null, '2025-05-19 21:55:33', '2025-05-19 21:55:33') returning "id"
---
    public function store(Request $request)
    {
        $data = $request->validate([
            'marca' => 'required',
            'codigo' => 'required|string|max:30',
            'nome' => 'required|string',
            'potencia' => 'nullable',
            'voltagem_minima' => 'nullable',
            'voltagem_maxima' => 'nullable',
            'corrente_maxima_entrada' => 'nullable'
        ]);

        $aparelho_eletrico = AparelhoEletrico::create($data);

select * from "aparelho_eletrico" where "aparelho_eletrico"."id" = '3' limit 1
---
    public function show($id)
    {
        $aparelho_eletrico = AparelhoEletrico::findOrFail($id);

select * from "aparelho_eletrico" where "aparelho_eletrico"."id" = '3' limit 1
---
    public function edit($id)
    {
        $aparelho_eletrico = AparelhoEletrico::findOrFail($id);

select * from "aparelho_eletrico" where "aparelho_eletrico"."id" = '2' limit 1
update "aparelho_eletrico" set "corrente_maxima_entrada" = '22.55000', "updated_at" = '2025-05-19 21:57:31' where "id" = 3
---
    public function update(Request $request, $id)
    {
        $aparelho_eletrico = AparelhoEletrico::findOrFail($id);
        $data = $request->validate([
            'marca' => 'required',
            'codigo' => 'required|string|max:30',
            'nome' => 'required|string',
            'potencia' => 'nullable',
            'voltagem_minima' => 'nullable',
            'voltagem_maxima' => 'nullable',
            'corrente_maxima_entrada' => 'nullable'
        ]);

        $aparelho_eletrico->update($data);

select * from "aparelho_eletrico" where "aparelho_eletrico"."id" = '2' limit 1
delete from "aparelho_eletrico" where "id" = 2
---
    public function destroy($id)
    {
        $aparelho_eletrico = AparelhoEletrico::findOrFail($id);

        $aparelho_eletrico->delete();