app/Http/Controllers/MarcaController.php

select * from "marca"
---
    public function index()
    {
        $marcas = Marca::all();

insert into "marca" ("nome", "updated_at", "created_at") values ('teste', '2025-05-19 20:38:47', '2025-05-19 20:38:47') returning "id"
---
    public function store(Request $request)
    {
        $data = $request->validate([
            'nome' => 'required|string'
        ]);

        $marca = Marca::create($data);

select * from "marca" where "marca"."id" = '3' limit 1
---
    public function show($id)
    {
        $marca = Marca::findOrFail($id);

select * from "marca" where "marca"."id" = '1' limit 1
---
    public function edit($id)
    {
        $marca = Marca::findOrFail($id);

select * from "marca" where "marca"."id" = '1' limit 1
update "marca" set "nome" = 'testee', "updated_at" = '2025-05-19 20:43:44' where "id" = 1
---
    public function update(Request $request, $id)
    {
        $marca = Marca::findOrFail($id);
        $data = $request->validate([
            'nome' => 'required|string'
        ]);

        $marca->update($data);

select * from "marca" where "marca"."id" = '2' limit 1
delete from "marca" where "id" = 2
---
    public function destroy($id)
    {
        $marca = Marca::findOrFail($id);

        $marca->delete();